import React from 'react';
import { GameItem } from '../../components/game-item';
import './home-page.css';

const GAMES = [
    {
        image: '/game-covers/forza_5.jpeg',
        title: 'Forza Horizon 5',
        genres: ['Гонки', 'Симулятор', 'Відкритий світ'],
        price: 1199.00,
        video: 'https://www.youtube.com/embed/FYH9n37B7Yw',
        id: 1,
        description: "На вас чекає нескінченний калейдоскоп пригод Horizon! Здійснюйте захоплюючі поїздки неймовірно красивим і самобутнім світом Мексики за кермом найбільших автомобілів в історії. Вас чекають захоплюючі поїздки неймовірно красивим і самобутнім світом Мексики за кермом найбільших автомобілів в історії.\n" +
            "\n" +
            "Перед вами відкриється світ краси та контрастів. Ви відвідаєте пустелі, густі джунглі, історичні міста, загублені руїни, чисті пляжі, глибокі ущелини та високий, покритий снігом вулкан.\n" +
            "\n" +
            "На вас чекає масштабна кампанія з сотнями випробувань на будь-який смак. Познайомтеся з новими персонажами та пройдіть їхні сюжетні лінії до кінця.\n" +
            "\n" +
            "Ви зіткнетеся з дивовижними природними явищами Мексики: курними бурями та тропічними зливами. Разом зі зміною пори року щотижня змінюється і світ гри. Щоразу на вас чекатимуть нові змагання, випробування, колекційні предмети, нагороди та ще не досліджені регіони. У світі Forza Horizon кожну пору року добре по-своєму!",
    },
    {
        image: '/game-covers/Sims_4.jpeg',
        title: 'Sims 4',
        genres: ['Симулятор життя', 'Симулятор навчання'],
        price: 1199.00,
        video: 'https://www.youtube.com/embed/z00mK3Pxc8w',
        id: 2,
        description: "Дайте волю своїй уяві та створіть світ з унікальними сімами! Вибирайте та змінюйте будь-які деталі як симів, так і їхніх будинків. І це ще не все! Вибирайте зовнішність, характер та вбрання для своїх симів та вирішуйте, як вони будуть проводити свої дні.\n" +
            "\n" +
            "Проектуйте та будуйте чудові будинки для кожної сім'ї та вибирайте меблі та декор. Подорожуйте різними містами, зустрічайте інших симів і знайомтеся з їхнім життям.\n" +
            "\n" +
            "Відкрийте для себе чудові місця з унікальними краєвидами та знаходите захоплюючі пригоди. Слідкуйте за повсякденним життям симів та обігруйте реалістичні чи фантастичні сценарії! Розповідайте свої історії, а також будуйте стосунки, займайтеся кар'єрою, досягайте життєвих цілей — пориньте в незвичайну гру, в якій ваші можливості безмежні.",
    },
    {
        image: '/game-covers/battlefield_2042.jpg',
        title: 'Battlefield 2042',
        genres: ['Екшн', 'Шутер', 'Війна'],
        video: 'https://www.youtube.com/embed/ASzOzrB-a9E',
        price: 1389.00,
        id: 3,
        description: 'Battlefield™ 2042 – це шутер від першої особи, в якому серія повертається до легендарних масштабних битв. Адаптуйтеся та долайте труднощі у світі найближчого майбутнього, де панує хаос. Вирушайте на неймовірно масштабні поля бою для 128 гравців, які постійно змінюються, зі своїм загоном і арсеналом новітніх технологій. . Відчуйте лють глобальної війни на картах з мінливими погодними умовами та видовищними ігровими подіями.'
    },
    {
        image: '/game-covers/life_is_strange_true_colors.jpeg',
        title: 'Life is Strange True Colors',
        genres: ['Глибокий сюжет', 'Протагоністка'],
        video: 'https://www.youtube.com/embed/b6CkzwVAr0M',
        price: 1477.00,
        id: 4,
        description: 'В історії популярної серії Life is Strange починається наступний етап - вам належить познайомитися з новою головною героїнею та розкрити хвилюючу таємницю!\n' +
            '\n' +
            'Алекс Чень давно приховує від усіх своє «прокляття» — надприродне вміння зчитувати та поглинати сильні почуття інших людей, які видаються їй у вигляді різнокольорових аур, а також керувати ними.\n' +
            '\n' +
            'Коли її брат гине - нібито внаслідок нещасного випадку, - Алекс доводиться опанувати самотужки, щоб дізнатися правду ... і заразом розкрити похмурі таємниці маленького містечка.'
    },
    {
        image: '/game-covers/gta_v.jpeg',
        title: 'Grand Theft Auto V',
        genres: ['Відкритий світ', 'Екшн'],
        video: 'https://www.youtube.com/embed/QkkoHAzjnUs',
        price: 456.00,
        id: 5,
        description: 'Коли молодий вуличний шахрай, відставний грабіжник банків і небезпечний для суспільства психопат опиняються в розборці з найстрашнішими і божевільними представниками кримінального світу, уряду США та індустрії розваг, їм доводиться виконати серію ризикованих нальотів, щоб вижити в безжалісному місті, де вони нікому – і насамперед одне одному.\n' +
            '\n' +
            'Grand Theft Auto V для PC дозволяє гравцям досліджувати знаменитий світ Лос-Сантоса та округу Блейн у роздільній здатності до 4k і вище з частотою 60 кадрів на секунду.\n' +
            '\n' +
            'Гра пропонує безліч унікальних для комп\'ютера налаштувань, у тому числі понад 25 окремих параметрів для налаштування якості текстур, шейдерів, тесселяції, згладжування та не тільки, а також підтримку та налаштування керування за допомогою клавіатури та миші. З додаткових можливостей можна відзначити повзунок населеності міста, що управляє щільністю потоку машин та пішоходів, підтримку двох та трьох моніторів, підтримку 3D та функцію «plug-and-play» для геймпадів.'
    },
    {
        image: '/game-covers/rainbow_siege.jpeg',
        title: 'Tom Clancy\'s Rainbow Six® Siege',
        video: 'https://www.youtube.com/embed/6wlvYh0h63k',
        genres: ['Тактика', 'Шутер'],
        price: 251.00,
        id: 6,
        description: 'Освойте мистецтво руйнування та використання пристроїв у Rainbow Six Облогу. На гравців чекають напружені бої на коротких дистанціях та відкритому просторі. Нова частина серії ігор Tom Clancy\'s Rainbow Six виводить гарячі перестрілки, вправність та досвід, тактичне планування та змагальний аспект на новий рівень. Набирайте команду з найдосвідченіших оперативників спецпідрозділів з усього світу. Використовуйте новітні технології стеження ворога. Руйнуйте стіни, щоб створити нові вогневі позиції. Пробивайте проломи в підлозі та стелі та використовуйте їх як нові точки входу. Застосовуйте зброю та пристрої, доступні в спорядженні, щоб змінити оточення, виявити ворога, перехитрити його та усунути загрозу. Зберіть міцну команду та приєднуйтесь до спільноти в рамках щотижневих турнірів, або слідкуйте за успіхами найкращих у змаганнях професійної ліги Rainbow Six.'
    },
    {
        image: '/game-covers/assassins_creed_valhalla.png',
        title: 'Assassin’s Creed Valhalla',
        genres: ['Паркур', 'РПГ', 'Відкритий світ'],
        video: 'https://www.youtube.com/embed/ssrNcwxALS4',
        price: 915.00,
        id: 7,
        description: 'Дія гри починається в 873 році в часи завоювань вікінгів . Гравцеві належить взяти на себе роль вікінга Ейвор, який веде своїх родичів від берегів холодної Норвегії до родючих земель Англії у пошуках нового будинку. Клану Ейвор протистоять лідери чотирьох англо-саксонських королівств: Вессекса , Нортумбрії , Східної Англії та Мерсії на чолі з Альфредом Великим . Також Ейвор має зустрітися з Незримими та допомогти їм у боротьбі проти Ордену давніх . Як і в попередній частині серії в XXI столітті продовжується історія Лейли Хассан. Крім Англії та Норвегії дія гри також відбувається на території Північної Америки, під назвою Вінланд та у фантастичних світах: Асгарді, Йотунхеймі та Вальхаллі.'
    },
    {
        image: '/game-covers/baldurs.jpg',
        title: 'Baldur`s gate III',
        genres: ['РПГ', 'Квест', 'Стратегічна гра'],
        video: 'https://www.youtube.com/embed/t9yyRvAiXvc',
        price: 964.00,
        id: 8,
        description: 'Baldur Gate III – це третина знаменитої рольової серії, яка відійшла від BioWare до Larian. Гра будується на пятій версії правил Dungeons and Dragons, а також розповідає нову історію. У центрі уваги - раптова атака іллітідів, свіжів розуму, які нападають на міста та селища з метою викрадення людей. Головний герой та його потенційні компаньйони – одні з викрадених людей, яким іллітиди вживили в голову своїх личинок. Героям належить знайти спосіб позбутися їх доти, як завершиться цереброморфирование. Третя частина серії заснована на пятій редакції правил D&D, тому багато речей, знайомих фанатам оригінальної дилогії змінилися. Наприклад, бойова система в BG3 - покрокова, а чи не RTWP, одночасно групи може бути трохи більше чотирьох компаньйонів тощо'
    },
    {
        image: '/game-covers/witcher3.jpg',
        title: 'The Wither 3: Wild Hunt',
        genres: ['РПГ', 'Відкритий світ', 'Глибокий сюжет', 'Action-adventure'],
        video: 'https://www.youtube.com/embed/53MyR_Z3i1w',
        price: 539.00,
        id: 9,
        description: 'Стати професійним вбивцею монстрів і вирушайте в пригоду епічних масштабів! Після свого виходу гра "Відьмак 3: Дике Полювання" (The Witcher 3: Wild Hunt) стала справжньою класикою, отримавши понад 250 нагород у номінації "Гра року". На вас чекає більше 100 годин грандіозної пригоди по відкритому світу, а також сюжетні розширення, які розтягнуться ще на 50 годин гри. Це видання включає весь додатковий контент: нову зброю, броню, екіпірування для компаньйонів, новий режим гри та побічні квести.\n' +
            'Зіграйте за чудово навченого найманця - вбивцю монстрів\n' +
            'Відьмаки - це воїни, натреновані з раннього дитинства. Мутація наділила їх нелюдськими навичками, силою і рефлексами, через що вони стали ізгоями і єдиними, хто може дати відсіч кишить монстрами світу.'
    },
    {
        image: '/game-covers/detroit.jpg',
        title: 'Detroit: Become Human',
        genres: ['Пригодницький бойовик', 'Глибокий сюжет', 'Інтерактивне кіно'],
        video: 'https://www.youtube.com/embed/QD1pbWCJcKQ',
        price: 637.00,
        id: 10,
        description: 'Детройт, 2038 рік. Технології розвинулися настільки, що людиноподібні андроїди зустрічаються на кожному кроці. Вони кажуть, рухаються, поводяться наче людські істоти, але вони — лише машини на службі у людей.\n' +
            'Грайте за трьох різних андроїдів і спостерігайте світ на межі хаосу – наше можливе майбутнє – їхніми очима. Кожне ваше рішення призведе до драматичних поворотів напруженого сюжету гри, що гілкується.\n' +
            'Ви зіткнетеся з моральними дилемами, вам належить вирішувати, кому жити і кому померти. Якими будуть майбутнє Детройта і доля людства в результаті тисяч прийнятих вами рішень і десятків можливих кінцівок?'
    },
    {
        image: '/game-covers/FIFA22.jpg',
        title: 'FIFA 22',
        genres: ['Футбольний симулятор', 'Спортивна гра'],
        video: 'https://www.youtube.com/embed/wC-AGjMoRa4',
        price: 500.00,
        id: 11,
        description: 'EA SPORTS™ FIFA 22 як ніколи наближає гру до реальності з фундаментальним покращенням ігрового процесу та інноваціями у всіх режимах. \n' +
            '\n' +
            'Серед нових можливостей ігрового процесу FIFA 22 – велика стабільність на останньому рубежі за рахунок зміни поведінки воротарів, нові фізичні характеристики м\'яча, вибухові ривки, які віддають належне прискоренню найшвидших футболістів світу, а також нові тактики нападу, що дозволяють контролювати гру команди. Здійсніть свої футбольні мрії в режимі кар\'єри - створіть футбольний клуб і ведіть його до слави. VOLTA FOOTBALL винагороджує вас за вашу філігранну техніку зі зміненим ігровим процесом та новими способами грати та прогресувати у кожному сезоні.'
    },
    {
        image: '/game-covers/Cyberpunk.jpg',
        title: 'Cyberpunk 2077',
        genres: ['Кіберпанк', 'РПГ', 'Відкритий світ'],
        video: 'https://www.youtube.com/embed/LembwKDo1Dk',
        price: 889.00,
        id: 12,
        description: 'Cyberpunk 2077 – це пригодницький екшн у відкритому світі, сюжет якого розгортається в мегаполісі Найт-Сіті, де влада, розкіш та модифікації тіла цінуються найвище. Ви граєте за V, найманця у пошуках унікального імпланту, що дозволяє знайти безсмертя. Ви можете змінювати кіберімпланти, навички та стиль гри свого персонажа, досліджуючи відкритий світ, де ваші вчинки впливають на перебіг сюжету та все, що вас оточує.'
    },
    {
        image: '/game-covers/Age_of_Empires4.jpg',
        title: 'Age of Empires IV',
        genres: ['Стратегія', 'Стратегія у реальному часі', 'Тактика'],
        video: 'https://www.youtube.com/embed/riKyuH3cRYU',
        price: 699.00,
        id: 13,
        description: 'Одна з найкращих стратегій у реальному часі повертається! Age of Empires IV перенесе вас до епіцентру великих історичних битв, що назавжди змінили долю світу. Для створення могутньої імперії ви зможете використовувати як знайомі, так і нові методи ведення війни - і все це на гігантських картах у високоякісному дозволі 4K. Age of Empires IV – це стратегія у реальному часі наступного покоління!\n' +
            '\n' +
            'Минуле оживає на очах: ​​станьте свідком історичних подій, очоливши одну з 8 детально відтворених середньовічних цивілізацій з усього світу – від Англії до Китаю та Делійського султанату. Зводьте міста, видобувайте ресурси, боріться на суші та на морі в 4 унікальних кампаніях з 35 завдань, що охоплюють період 500 років — від темних віків до епохи Відродження.',
    },
    {
        image: '/game-covers/Mafia2.jpg',
        title: 'Mafia II',
        genres: ['Екшн', 'Кримінал', 'Шутер', 'Відкритий світ'],
        video: 'https://www.youtube.com/embed/BlCcG0yC44Q',
        price: 549.00,
        id: 14,
        description: 'Віто Скалетта почав завойовувати собі репутацію на вулицях Емпайр Бей, будучи «тим, хто точно виконає свою роботу». Разом зі своїм другом Джо він уперто виконує різні доручення, щоб завоювати довіру Мафії, швидко піднімаючись по «сімейних» сходах, все сильніше порушуючи закон, все сильніше піднімаючи свій статус і все сильніше наближаючи момент, коли йому доведеться зіткнутися з наслідками своїх дій… Схоже , бути мафіозі не так і просто, як може здатися.',
    },
    {
        image: '/game-covers/GodofWar.jpg',
        title: 'God of War',
        genres: ['Екшн', 'Пригоді', 'Відкритий світ'],
        video: 'https://www.youtube.com/embed/e5dFIKAPxhU',
        price: 1199.00,
        id: 15,
        description: 'Помстившись богам Олімпу, Кратос живе у царстві скандинавських божеств і чудовиськ. У цьому суворому жорстокому світі він повинен не тільки самостійно боротися за виживання... але й навчити цього сина. Кратос знову батько. Будучи наставником і захисником сина, який прагне заслужити пошану батька, Кратос отримав несподівану можливість приборкати власний гнів, який довгий час визначав його вчинки. опинитися в нових місцях зі своїм пантеоном істот, чудовиськ і богів.',
    },
]


export const HomePage = () => {
    return (
        <div className="home-page">
            { GAMES.map(game => <GameItem game={game} key={game.id}/>) }
        </div>
    )
}